  

Задание на лабораторную работу:

- Составить программу, которая во вводимой с клавиатуры строке удаляет все вхождения подстроки введенной с клавиатуры. Преобразованную строку вывести на экран.
- Ввести с клавиатуры строку. После каждого символа ‘a’ вставить пробел. Преобразованную строку вывести на экран.
- Выяснить, все ли символы во введенной с клавиатуры строке являются буквами.

  

> **Код решения:**
> 
> ```Plain
> \#include <iostream>
> \#include <string>
> \#include <windows.h>
> 
> using namespace std;
> // С++ также предоставляет для удаления символов специальную функцию - erase().
> // В качестве параметров она принимает начальный индекс удаления и количество удаляемых символов
> 
> // функция для удаления всех вхождений подстроки из строки
> void removeSubstring(string& str, const string& substr)
> {
>     size_t pos = 0;
>     while ((pos = str.find(substr, pos)) != string::npos)
>     {
>         str.erase(pos, substr.length());
>     }
> }
> 
> // Для вставки одной строки в другую применяется функция insert(). Она имеет несколько различных версий.
> 
> // функция для вставки пробелов после каждого символа 'a' в строке
> void VSTAVKAPROBELA(string& str)
> {
>     size_t pos = 0;
>     while ((pos = str.find('a', pos)) != string::npos)
>     {
>         str.insert(pos + 1, " ");
>         pos += 2; // увеличиваем на 2, т.к. добавили символ и пробел
>     }
> }
> 
> // Функция для проверки, является ли символ буквой
> bool BUKVA(char c)
> {
>     return (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z'); // && and; || or
> }
> 
> // Функция для проверки, все ли символы в строке являются буквами
> bool vseBUKVI(const string& str) {
>     for (char c : str)
>     {
>         if (!BUKVA(c))
>         {return false;}
>     }
>     return true;
> }
> 
> int main() {
>     setlocale(LC_ALL, "RU_ru.UTF-8");
>     SetConsoleCP(CP_UTF8);
>     SetConsoleOutputCP(CP_UTF8);
> 
>     // ввод строки
>     string input;
>     cout << "Введите строку: ";
>     getline(cin, input);        // используем getline для удобного ввода строки
> 
>     // ввод подстроки
>     string substring;
>     cout << "Введите подстроку для удаления: ";
>     cin >> substring;
> 
>     // удаление подстроки из строки
>     removeSubstring(input, substring);
> 
>     // вставка пробелов после каждого символа 'a'
>     VSTAVKAPROBELA(input);
> 
>     // Вывод результата
>     cout << "Результат после удаления подстроки и вставки пробелов:" << endl;
>     cout << input << endl;
> 
>     // Проверка, все ли символы в строке являются буквами
>     if (vseBUKVI(input))
>     {cout << "Все символы во введенной строке являются буквами." << endl;}
>     else
>     {cout << "Не все символы во введенной строке являются буквами." << endl;}
> 
>     return 0;
> }
> ```